"""Дополните приведенный ниже код, чтобы он вывел текущую дату в ISO формате (YYYY-MM-DD).

Напишите программу. Тестируется через stdin → stdout

Time Limit: 15 секунд
Memory Limit: 256 MB

# импортируем тип date из модуля datetime
from ____ import ____

# выводим текущую дату
print(____)
"""

from datetime import date

print(date.today())
