from datetime import date

"""Напишите программу, которая принимает на вход последовательность дат и выводит их в
порядке неубывания.
Формат входных данных
На вход программе подается натуральное число n, а затем n корректных дат в ISO формате
( YYYY-MM-DD ), каждая на отдельной строке.
Формат выходных данных
Программа должна вывести введенные даты в порядке неубывания, каждую на отдельной
строке, в формате DD/MM/YYYY ."""
n = int(input())

dates = sorted(date.fromisoformat(input()) for _ in range(n))
dates = [d.strftime("%d/%m/%Y") for d in dates]

print(*dates, sep="\n")
